tutorials/fluidSolidInteraction/channelLeaflet/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Channel of unit height, 0 < x < 8, with the leaflet of height 0.5
// and thickness 0.05 centred on x = 1 cut out of the fluid domain
scale 1;

vertices
(
    (0 0 0) // 0
    (0.975 0 0) // 1
    (1.025 0 0) // 2
    (8 0 0) // 3
    (0 0.5 0) // 4
    (0.975 0.5 0) // 5
    (1.025 0.5 0) // 6
    (8 0.5 0) // 7
    (0 1 0) // 8
    (0.975 1 0) // 9
    (1.025 1 0) // 10
    (8 1 0) // 11
    (0 0 0.1) // 12
    (0.975 0 0.1) // 13
    (1.025 0 0.1) // 14
    (8 0 0.1) // 15
    (0 0.5 0.1) // 16
    (0.975 0.5 0.1) // 17
    (1.025 0.5 0.1) // 18
    (8 0.5 0.1) // 19
    (0 1 0.1) // 20
    (0.975 1 0.1) // 21
    (1.025 1 0.1) // 22
    (8 1 0.1) // 23
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (40 40 1) simpleGrading (0.29844409 1 1)
    hex (4 5 9 8 16 17 21 20) (40 40 1) simpleGrading (0.29844409 1 1)
    hex (5 6 10 9 17 18 22 21) (4 40 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (160 40 1) simpleGrading (((2 100 2.3995757) (4.975 60 5.7937367)) 1 1)
    hex (6 7 11 10 18 19 23 22) (160 40 1) simpleGrading (((2 100 2.3995757) (4.975 60 5.7937367)) 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 19 15)
            (7 11 23 19)
        );
    }
    interface
    {
        type wall;
        faces
        (
            (1 5 17 13)
            (5 6 18 17)
            (2 14 18 6)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (2 3 15 14)
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (12 13 17 16)
            (4 8 9 5)
            (16 17 21 20)
            (5 9 10 6)
            (17 18 22 21)
            (2 6 7 3)
            (14 15 19 18)
            (6 10 11 7)
            (18 19 23 22)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
