tutorials/fluidSolidInteraction/channelLeaflet/system/solid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Leaflet of thickness 0.05 and height 0.5 centred on x = 1,
// clamped at its base, y = 0
scale 1;

vertices
(
    (0.975 0 0)
    (1.025 0 0)
    (1.025 0.5 0)
    (0.975 0.5 0)
    (0.975 0 0.1)
    (1.025 0 0.1)
    (1.025 0.5 0.1)
    (0.975 0.5 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (4 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    interface
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (3 7 6 2)
            (1 2 6 5)
        );
    }
    base
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
