tutorials/fluidSolidInteraction/channelLeaflet/constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress     no;

// St Venant-Kirchhoff leaflet: the second Piola-Kirchhoff stress is linear in
// the Green strain, as in the reference Kirchhoff-Love beam. In plane strain
// the leaflet's axial and bending stiffness follow from
// E/(1 - nu^2) = mu U/(a Q) = 5000 Pa, with Q = 1e-6
mechanical
(
    leaflet
    {
        type            StVenantKirchhoffElastic;
        // Regularising density: the reference leaflet is massless, but a
        // massless leaflet makes the partitioned coupling ill-posed.
        // rho_s = rho_f = 1 kg/m^3 is used, and the oomph-lib reference is
        // computed with the same density (see the README)
        rho             rho [1 -3 0 0 0 0 0] 1;
        E               E [1 -1 -2 0 0 0 0] 4550;
        nu              nu [0 0 0 0 0 0 0] 0.3;
    }
);

// ************************************************************************* //
