tutorials/fluidSolidInteraction/channelLeaflet/system/solid/fvSolution.linear
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/solid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    D
    {
        solver petsc;

        options
        {
            // Nonlinear solver
            snes_type newtonls;
            snes_linesearch_type basic;
            // The tractions are of order 1 Pa and the modulus 5 kPa, so the
            // absolute tolerance sits well below the residual of a step
            snes_rtol "1e-9";
            snes_atol "1e-12";
            snes_stol "1e-12";
            snes_max_it "100";

            // The first Newton step of a large rotation can overshoot by
            // orders of magnitude before the geometric stiffness catches up,
            // so do not treat a growing residual as divergence
            snes_divergence_tolerance "1e12";
            snes_converged_reason;

            // Matrix-free finite-difference Jacobian, preconditioned by the
            // assembled Jacobian of the least-squares reconstruction
            snes_mf_operator;

            // Linear solver
            ksp_type lgmres;
            ksp_gmres_restart "100";
            ksp_converged_reason;

            // Rebuild the preconditioner at every Newton step: the leaflet
            // rotates by tens of degrees, and a preconditioner from the
            // undeformed configuration then stalls the Krylov solver
            snes_lag_preconditioner "1";

            // Preconditioner - LU
            pc_type bjacobi;
            sub_pc_type lu;
        }
    }
}

// ************************************************************************* //
