tutorials/fluidSolidInteraction/channelLeaflet/Allrun
#!/bin/bash

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Source solids4Foam scripts
source solids4FoamScripts.sh

# Example usage
# ./Allrun            # high-order (cubic) solid
# ./Allrun linear     # second-order solid: linear reconstruction
# The case runs in serial: see the README

# The case needs OpenFOAM.com, for the radial-basis-function mesh motion, and
# PETSc
solids4Foam::caseDoesNotRunWithFoamExtend
solids4Foam::caseDoesNotRunWithOpenFOAMOrg
solids4Foam::requirePetscOrExitSilently

solidVariant=highOrder

for arg in "$@"
do
    case "$arg" in
        linear)
            solidVariant="$arg"
            ;;
        *)
            echo "Unknown option: $arg"
            echo "Usage: ./Allrun [linear]"
            exit 1
            ;;
    esac
done

ln -vnsf "solidProperties.${solidVariant}" constant/solid/solidProperties
ln -vnsf "fvSolution.${solidVariant}" system/solid/fvSolution

# Check case version is correct
solids4Foam::convertCaseFormat .

# Create meshes
solids4Foam::runApplication -s solid blockMesh -region solid
solids4Foam::runApplication -s fluid blockMesh -region fluid

# Run solver
solids4Foam::runApplication solids4Foam

# Create plots
if command -v gnuplot &> /dev/null
then
    echo "Generating tip.pdf using gnuplot"
    gnuplot tip.gnuplot &> /dev/null
else
    echo "Please install gnuplot if you would like to generate the plots"
fi
